# GetLightSourceTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightFamily..::..GetLightSourceTransform Method
LightFamily Class See Also
---
Returns a Transform value for the transform of light source.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Transform GetLightSourceTransform()
```

Visual Basic
---
```text
Public Function GetLightSourceTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetLightSourceTransform()
```

# ### Return Value
The light source transform.
# Remarks
When the user moves or rotates the light source in family editor, the returned Transform gets changed accordingly.
# See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace